// Лабораторна робота #3. Завдання #2. Варіант #15.
// Групу студентів розбито на підгрупи A, B, C по 10 осіб.
// Скласти програму, яка б виводила назву підгрупи
// в залежності від варіанту студента.

#include <iostream>

using namespace std;

int main()
{
	int i;

	cout << "\nВведіть номер:\t";
	cin >> i;

	// Сама конструкція switch не годиться для перебору всіх випадків,
	// особливо коли у деяких варіантах є ще діапазон.
	// Тому я створив алгоритм автоматичного розподілу на три підгрупи.
	//
	// Як це працює? Беремо номер варіанту і ділимо по модулю на три.
	// Якщо остача від ділення буде 0, то це буде C підгрупа,
	// якщо 1, то буде A підгрупа, якщо 2 то B підгрупа.
	//
	// Ще одна унікальність данного алгоритму полягає в тому,
	// що воно Враховування нових студентів, якщо таке станеться.
	switch (i%3) {
	case 0:
		cout << "Група:\t\tC\n" << endl;
		break;
	case 1:
		cout << "Група:\t\tA\n" << endl;
                break;
	case 2:
		cout << "Група:\t\tB\n" << endl;
                break;
	default:
		cout << "Не корректне значення" << endl;
	}

	return 0;
}
