// Лабораторна робота #1

#include <iostream>
#include <string>

using namespace std;

int main()
{
	puts("\nПривіт світ!\n");

	// Для змінної name я використав тип string,
	// оскільки це дозволяє автоматично визначати довжину стрічки.
	string name;
	char group[10] = "КІ-602";
	char section[50] = "Електронних апаратів";
	char specialty[50] = "Комп'ютерна інженерія";

	cout << "Введіть ім'я та прізвище: ";

	// Функція cin буде записувати значення лише до першого пробілу,
	// тому краще використовувати функцію getline() для усунення цього недоліку.
	getline(cin, name);

	cout << "\nВідділення:\t\t" << section << endl;
	cout << "Среціальність:\t\t" << specialty << endl;
	cout << "Група:\t\t\t" << group << endl;
	cout << "Ім'я та прізвище:\t" << name << endl << endl;

	// Оскільки робота виконюється безпосередньо у консолі,
	// то необхідність використання данної функції відпадає.
	// system("pause");

	return 0;
}
