// Лабораторна робота #5. Завдання #1.
//
// Знайти середнє значення позитивних елементів масиву, якщо позитивне
// значення масиву менше середнього, то замінити на середнє значення.
//
// Розмірність масиву:	200.
// Діапазон значень: 	Від -100 до 100.

#include <iostream>
#include <iomanip>

using namespace std;

int main()
{
	int Sum_Positive_Values = 0;   // Сума позитивних значень.
	int Count_Positive_Values = 0; // Кількість позитивних значень.
	int Average_Values = 0;        // Середнє значення.
	int arr[22][10];               // Масив для збереження згенерованих чисел.
	
                                       // Маленький костиль з масивом.
                                       // Нумерація починається з 0, а закінчується на 22.

	srand(time(NULL));	       // Ініціалізація rand()

	cout << "\nЗдійснюємо генерацію самого масиву (без змін).\n\n";

	for(int i = 1; i <= 20; i++) {

		// Нумерація для зручності.
		cout << setw(2) << i << ": ";

		// Генерація чисел та збереження у їх у масив.
		for(int j = 1; j <= 10; j++) {
			arr[i][j] = rand() % 201 -100;
			cout << setw(5) << arr[i][j];
		}

		cout << endl;
	}

	cout << "\nВиведення редагованого масиву (згідно зі завданням).\n\n";

	for(int i = 1; i <= 20; i++) {

		cout << setw(2) << i << ": ";

		// В данному циклі шукаємо середнє значення.
		for(int j = 1; j <= 10; j++) {

			// Визначаємо, чи позитивне значення,
			// якщо ні, то беремо наступне число.
			if( 0 < arr[i][j] ) {
				Sum_Positive_Values += arr[i][j];
				Count_Positive_Values++;
			}
		}

		Average_Values = Sum_Positive_Values / Count_Positive_Values;

		// Використовуємо середнє значення для заміни
		// позитивного значення, яке є менше середнього.

		for(int j = 1; j <= 10; j++) {
			if( arr[i][j] < Average_Values && 0 < arr[i][j] ) {
				cout << "\e[32m"; // ВІДКЛАДКА
				cout << setw(5) << Average_Values;
				cout << "\e[m"; // ВІДКЛАДКА
			} else {
				cout << setw(5) << arr[i][j];
			}
		}

		// Виведення середнього значення для зручності.
		cout << "  |  " <<  Average_Values << endl;
	}

	cout << endl;

	return 0;
}
